# sudo pacman -S --needed $(cat pkglist.txt | cut -d' ' -f1)

acpi
acpi_call
acpid
alacritty
alsa-plugins
alsa-tools
alsa-utils
arc-gtk-theme
arc-icon-theme
base
base-devel
bash-completion
bat
bitwarden
blueman
bluez
bluez-utils
bridge-utils
bspwm
btrfs-progs
cups
dialog
discord
dmenu
dosfstools
dunst
exa
feh
firewalld
flatpak
gimp
git
github-cli
gpick
grub
grub-btrfs
gvfs
gvfs-google
gvfs-mtp
gvfs-smb
htop
inkscape
ipset
iptables-nft
kitty
krita
libreoffice-fresh
linux
linux-firmware
linux-headers
lxappearance
mpd
mpv
mtools
ncmpcpp
neofetch
neovim
network-manager-applet
networkmanager
networkmanager-openvpn
nfs-utils
nodejs
noto-fonts-emoji
nss-mdns
ntfs-3g
numlockx
openbsd-netcat
otf-hermit
otf-hermit-nerd
pacman-contrib
pamixer
pavucontrol
pcmanfm
picom
playerctl
plocate
polybar
python-dbus-next
python-mpd2
python-pip
pulseaudio
pulseaudio-alsa
qtile
ranger
reflector
rofi
rsync
scrot
sddm
sof-firmware
sxhkd
telegram-desktop
terminus-font
thunar
thunderbird
timeshift
tlp
transmission-gtk
ttf-joypixels
udiskie
vde2
vim
wget
xdg-user-dirs
xdg-utils
xdotool
xf86-video-intel
xf86-video-vesa
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbprint
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
zsh
zsh-autosuggestions
zsh-completions
zsh-history-substring-search
zsh-syntax-highlighting

# Audio and video codecs
a52dec
faac
faad2
flac
jasper
lame
libdca
libdv
libmad
libmpeg2
libtheora
libvorbis
libxv
wavpack
gstreamer0.10-plugins
alsa-card-profiles
alsa-plugins
alsa-firmware
gst-libav
gst-plugin-pipewire
gst-plugins-base
gst-plugins-good
gst-plugins-bad
gst-plugins-ugly
gstreamer
gstreamer-vaapi
x264
x265
xvidcore

#Printers
cups
cups-pdf
cups-filters
cups-pk-helper
foomatic-db
foomatic-db-engine
foomatic-db-gutenprint-ppds
foomatic-db-ppds
foomatic-db-nonfree
foomatic-db-nonfree-ppds
ghostscript
gsfonts
gutenprint
python-pillow
python-pip
python-pyqt5
python-reportlab
system-config-printer

#Network
avahi
dnsutils
firewalld
net-tools
netctl
networkmanager
networkmanager-openvpn
network-manager-applet
nm-connection-editor
nss-mdns
wget
whois

#Fonts
inter-font
noto-fonts
ttf-bitstream-vera
ttf-caladea
ttf-carlito
ttf-cascadia-code
ttf-croscore
ttf-dejavu
ttf-droid
ttf-fira-code
ttf-fira-mono
ttf-fira-sans
ttf-inconsolata
ttf-liberation
ttf-opensans
ttf-roboto
ttf-ubuntu-font-family

#Drivers
dkms
haveged
intel-media-driver
libva-mesa-driver
libva-utils
linux-headers
mesa
mesa-vdpau
virtualbox-guest-utils


